In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [3]:
import pandas as pd

In [32]:
data = pd.DataFrame({"Name": ['Aragorn', 'Boromir', 'Frodo','Galadriel'],
                     "Race": ["human", "human", "hobbit", "elf"],
                     "Age": [88,41,51,8382]})
data

        Name    Race   Age
0    Aragorn   human    88
1    Boromir   human    41
2      Frodo  hobbit    51
3  Galadriel     elf  8382

In [11]:
data divide(row):
        result = row['Age']/10
        return result

data['age_valinor'] = data.apply(divide, axis=1)
data

SyntaxError: invalid syntax (2025162380.py, line 1)

In [14]:
def divide(row):
    result = row['Age']/10
    return result

data['age_valinor'] = data.apply(divide, axis=1)
data

        Name    Race   Age  age_valinor
0    Aragorn   human    88          8.8
1    Boromir   human    41          4.1
2      Frodo  hobbit    51          5.1
3  Galadriel     elf  8382        838.2

In [24]:
divide_2 = lambda x: x/10
divide_2(data['Age'])

0      8.8
1      4.1
2      5.1
3    838.2
Name: Age, dtype: float64

In [42]:
data['age_2'] = divide_2(data['Age'])

data

        Name    Race   Age  age_3  age_2
0    Aragorn   human    88    8.8    8.8
1    Boromir   human    41    4.1    4.1
2      Frodo  hobbit    51    5.1    5.1
3  Galadriel     elf  8382  838.2  838.2

In [44]:
data['age_3'] = data['Age'].apply(lambda x: x/10)

data

        Name    Race   Age  age_3  age_2
0    Aragorn   human    88    8.8    8.8
1    Boromir   human    41    4.1    4.1
2      Frodo  hobbit    51    5.1    5.1
3  Galadriel     elf  8382  838.2  838.2

In [46]:
data['age_label_2'] = data['Age'].apply(
    lambda x:  'elven old' if x > 500 else ('middle-aged' if x >=100 else 'young'))
data

        Name    Race   Age  age_3  age_2 age_label_2
0    Aragorn   human    88    8.8    8.8       young
1    Boromir   human    41    4.1    4.1       young
2      Frodo  hobbit    51    5.1    5.1       young
3  Galadriel     elf  8382  838.2  838.2   elven old